{
  "HomePage": {
    "navbarHome": "Home",
    "navbarServices": "Services",
    "navbarTechnologies": "Technologies",
    "navbarPortfolio": "Portfolio",
    "navbarContact": "Contact",

    "title": "Full Stack Developer",
    "subtitle": "As a freelance developer, I design and build tailored web and mobile applications. Whether working directly with clients or collaborating with tech and design professionals, I deliver high-quality, customized solutions to meet your needs.",

    "ctlText": "Do you have an idea ?",
    "ctlText2": "I can turn it into a product.",
    "ctlBtnText": "Let's Connect",
    "linkedinBtnTitleText": "Visit my LinkedIn profile",
    "maltBtnTitleText": "Visit my Malt profile",

    "servicesTitle": "What I Do ?",
    "servicesSubtitle": "I build and maintain high-performance websites & mobile apps—secure, scalable, and tailored to your goals. From concept to long-term support, let's make your digital vision a reality.",

    "techsTitle": "Technologies",
    "techsSubtitle": "I expertly wield cutting-edge technologies to build high-performance solutions across the full development lifecycle. By continuously adopting the latest industry innovations, I create scalable systems ready for future challenges.",

    "projectsTitle": "Some Projects",
    "projectsSubtitle": "Explore my recent work. Transforming ideas into powerful technical solutions.",

    "getIntouch": "Get in touch !",
    "getIntouchSubtitle": "Got a question or a project in mind? Let's talk !",

    "dontLikeFormsText": "Don't like forms ?",
    "dontLikeFormsTextForSendMail": "Send me an email.",

    "formTitle": "Send me a message",
    "formName": "Name",
    "formNamePlaceholder": "Your full name",

    "formEmail": "Email",
    "formEmailPlaceholder": "your.email@example.com",

    "formMessage": "Message",
    "formMessagePlaceholder": "Tell us how we can help you...",

    "formBtnSendMessageText": "Send message",
    "formBtnSendingMessageText": "Sending...",

    "successMessageToast": "Message sent successfully!",
    "errorMessageToast": "An error has occurred. Please try again later!",

    "rgpd": "Legal Notices",

    "closeBtn": "Close",
    "seeProjectBtn": "Go live"
  },

  "Services": {
    "service1": {
      "title": "Web Development",
      "description": "I create custom solutions for showcase websites and complex web applications, combining intuitive design, aesthetics, and robust architecture. I build high-performance, SEO-optimized sites using the latest technologies and frameworks to deliver modern and efficient results."
    },
    "service2": {
      "title": "Mobile Development",
      "description": "I develop hybrid mobile applications for smartphones and tablets, leveraging frameworks like Flutter to deliver custom solutions. My apps stand out with a strong focus on ergonomics and design, ensuring both usability and visual appeal. I stay ahead of the curve by integrating the latest technologies and frameworks for cutting-edge performance."
    },
    "service3": {
      "title": "Maintenance & Support",
      "description": "I provide reliable and proactive maintenance services to ensure your website or application runs smoothly at all times. I keep your digital assets secure, up-to-date, and aligned with evolving technologies. My goal is to minimize downtime while maximizing efficiency, so you can focus on growing your business."
    }
  },

  "Projects": {
    "gracoeiro": {
      "title": "Gracoeiro",
      "desc": "I designed and developed the professional website for Bárbara Graçoeiro, a debt collection expert, highlighting her impressive career path and professional certifications. The clean, modern design combined with intuitive navigation enhances her credibility while clearly presenting her specialized services. The website, optimized for SEO and fully mobile-responsive, now serves as a key platform for converting visitors into clients."
    },
    "joaocerqueirapereira": {
      "title": "João Cerqueira Pereira",
      "desc": "I re-designed and developed the website for João Cerqueira Pereira LDA, a Portuguese company specializing in electrical installations since 1977. The new design presents their technical expertise through a clean, corporate aesthetic that reflects the precision of their field, featuring intuitive navigation tailored for both individual and professional clients. SEO-optimized and fully mobile-responsive."
    },
    "artseecounsel": {
      "title": "Artseecounsel",
      "desc": "(in progress) Custom development of a sleek and high-performance showcase website for ArtseeCounsel, an independent financial consultant. The goal was to create a professional online presence that inspires trust and showcases the consultant's expertise and tailored services. I created this site to provide a seamless user experience and strategic content presentation to convert visitors into qualified leads."
    }
  },

  "LegalNotices": {
    "title": "Legal notices",
    "websitePublisher": "Website Publisher",
    "myName": "Fernandes Nuno",
    "myAdress": "Rue Pierre Curie, 78370 Plaisir",
    "myPhone": "+33 7 71 80 29 21",
    "myEmail": "n.fernandes.contact@gmail.com",

    "hostingProvider": "Hosting Provider",
    "hostingProviderName": "Vercel Inc",
    "hostingProviderWebSite": "www.vercel.com",

    "intellectualProperty": "Intellectual Property",
    "intellectualPropertyDesc": "All content on this site (texts, images, logos, code, etc.) is the exclusive property of Nuno Fernandes, unless stated otherwise. Unauthorized reproduction, modification, or commercial use is strictly prohibited.",

    "personalData": "Personal Data",
    "personalDataDesc": "This site does not collect personal data without explicit consent. Information provided via contact forms (name, email, message) is used solely to respond to inquiries and is never shared with third parties.",

    "cookies": "Cookies",
    "cookiesDesc": "This site uses no tracking or advertising cookies. Any technical cookies (essential for functionality) do not store identifiable information.",

    "liability": "Liability",
    "liabilityDesc": "While I strive to ensure accuracy, I cannot guarantee the completeness of the content. To report an error, please contact me via the email above.",

    "externalLinks": "External Links",
    "externalLinksDesc": "Links to third-party sites do not imply endorsement. I am not responsible for their content or privacy practices.",

    "governingLaw": "Governing Law",
    "governingLawDesc": "This site is governed by French law. Any disputes fall under the jurisdiction of Versailles (Yvelines, France).",

    "closeBtnText": "Close"
  },

  "ValidationForm": {
    "nameError": "The name must be at least 2 characters.",
    "emailError": "Invalid email address",
    "messageError": "The message must be at least 20 characters long."
  }
}
