{
  "HomePage": {
    "navbarHome": "Home",
    "navbarServices": "Services",
    "navbarTechnologies": "Technologies",
    "navbarPortfolio": "Portfolio",
    "navbarContact": "Contact",

    "title": "Full Stack Developer",
    "subtitle": "As a freelance developer, I design and build tailored web and mobile applications. Whether working directly with clients or collaborating with tech and design professionals, I deliver high-quality, customized solutions to meet your needs.",

    "ctlText": "Do you have an idea ?",
    "ctlText2": "I can turn it into a product.",
    "ctlBtnText": "Let's Connect",
    "linkedinBtnTitleText": "Visit my LinkedIn profile",
    "maltBtnTitleText": "Visit my Malt profile",

    "servicesTitle": "What I Do ?",
    "servicesSubtitle": "I build and maintain high-performance websites & mobile apps—secure, scalable, and tailored to your goals. From concept to long-term support, let's make your digital vision a reality.",

    "techsTitle": "Technologies",
    "techsSubtitle": "I expertly wield cutting-edge technologies to build high-performance solutions across the full development lifecycle. By continuously adopting the latest industry innovations, I create scalable systems ready for future challenges.",

    "projectsTitle": "Some Projects",
    "projectsSubtitle": "Explore my recent work. Transforming ideas into powerful technical solutions.",

    "getIntouch": "Get in touch !",
    "getIntouchSubtitle": "Got a question or a project in mind? Let's talk !",

    "dontLikeFormsText": "Don't like forms ?",
    "dontLikeFormsTextForSendMail": "Send me an email.",

    "formTitle": "Send me a message",
    "formName": "Name",
    "formNamePlaceholder": "Your full name",

    "formEmail": "Email",
    "formEmailPlaceholder": "your.email@example.com",

    "formMessage": "Message",
    "formMessagePlaceholder": "Tell us how we can help you...",

    "formBtnSendMessageText": "Send message",
    "formBtnSendingMessageText": "Sending...",

    "successMessageToast": "Message sent successfully!",
    "errorMessageToast": "An error has occurred. Please try again later!",

    "rgpd": "Legal Notices"
  },

  "Services": {
    "service1": {
      "title": "Web Development",
      "description": "I create custom solutions for showcase websites and complex web applications, combining intuitive design, aesthetics, and robust architecture. I build high-performance, SEO-optimized sites using the latest technologies and frameworks to deliver modern and efficient results."
    },
    "service2": {
      "title": "Mobile Development",
      "description": "I develop hybrid mobile applications for smartphones and tablets, leveraging frameworks like Flutter to deliver custom solutions. My apps stand out with a strong focus on ergonomics and design, ensuring both usability and visual appeal. I stay ahead of the curve by integrating the latest technologies and frameworks for cutting-edge performance."
    },
    "service3": {
      "title": "Maintenance & Support",
      "description": "I provide reliable and proactive maintenance services to ensure your website or application runs smoothly at all times. I keep your digital assets secure, up-to-date, and aligned with evolving technologies. My goal is to minimize downtime while maximizing efficiency, so you can focus on growing your business."
    }
  }
}
