{
  "HomePage": {
    "navbarHome": "Accueil",
    "navbarServices": "Services",
    "navbarTechnologies": "Technologies",
    "navbarPortfolio": "Portfolio",
    "navbarContact": "Contact",

    "title": "Développeur Full Stack",
    "subtitle": "En tant que développeur freelance, je conçois et développe des applications web et mobiles sur mesure. Que ce soit en collaboration directe avec mes clients ou avec des professionnels de la technologie et du design, je propose des solutions personnalisées de haute qualité pour répondre à vos besoins.",

    "ctlText": "Vous avez une idée ?",
    "ctlText2": "Je peux la transformer en produit.",
    "ctlBtnText": "Contactez-moi",
    "linkedinBtnTitleText": "Visitez mon profil LinkedIn",
    "maltBtnTitleText": "Visitez mon profil Malt",

    "servicesTitle": "Ce que je fais ?",
    "servicesSubtitle": "Je crée et maintiens des sites web et des applications mobiles performants, sécurisés, évolutifs et adaptés à vos objectifs. De la conception à l'accompagnement à long terme, je concrétise votre vision numérique.",

    "techsTitle": "Technologies",
    "techsSubtitle": "J'utilise avec expertise des technologies de pointe pour concevoir des solutions performantes tout au long du cycle de développement. En adoptant continuellement les dernières innovations du secteur, je crée des systèmes évolutifs prêts à relever les défis futurs.",

    "projectsTitle": "Quelques Projects",
    "projectsSubtitle": "Découvrez mes travaux récents. Transformer des idées en solutions techniques performantes.",

    "getIntouch": "Entrez en contact !",
    "getIntouchSubtitle": "Vous avez une question ou un projet en tête ? Discutons-en !",

    "dontLikeFormsText": "Vous n'aimez pas les formulaires ?",
    "dontLikeFormsTextForSendMail": "Envoyez-moi un e-mail.",

    "formTitle": "Envoie-moi un message",
    "formName": "Nom",
    "formNamePlaceholder": "Votre nom",

    "formEmail": "Email",
    "formEmailPlaceholder": "votre.email@example.com",

    "formMessage": "Message",
    "formMessagePlaceholder": "Dites-nous comment nous pouvons vous aider...",

    "formBtnSendMessageText": "Envoyer message",
    "formBtnSendingMessageText": " En cours d'envoi...",

    "successMessageToast": "Message envoyé avec succès!",
    "errorMessageToast": "Une erreur s'est produite. Veuillez réessayer ultérieurement!",

    "rgpd": "Mentions légales",

    "closeBtn": "Fermer",
    "seeProjectBtn": "Voir projet"
  },

  "Services": {
    "service1": {
      "title": "Développement Web",
      "description": "Je crée des solutions sur mesure pour la mise en valeur de sites web et d'applications web complexes, alliant design intuitif, esthétique et architecture robuste. Je crée des sites performants et optimisés SEO en utilisant les technologies et frameworks les plus récents pour des résultats modernes et performants."
    },

    "service2": {
      "title": "Développement Mobile",
      "description": "Je développe des applications mobiles hybrides pour smartphones et tablettes, en m'appuyant sur des frameworks comme Flutter ou React Native pour proposer des solutions sur mesure. Mes applications se distinguent par une attention particulière portée à l'ergonomie et au design, alliant ergonomie et un visuel attrayant. Je garde une longueur d'avance en intégrant les technologies et frameworks les plus récents pour des performances de pointe."
    },
    "service3": {
      "title": "Maintenance & Support",
      "description": "Je propose des services de maintenance fiables et proactifs pour garantir le bon fonctionnement de votre site web ou de votre application en permanence. Je veille à la sécurité, à la mise à jour et à l'adaptation de vos ressources numériques aux évolutions technologiques. Mon objectif est de minimiser les temps d'arrêt tout en maximisant l'efficacité, afin que vous puissiez vous concentrer sur la croissance de votre entreprise."
    }
  },

  "Projects": {
    "gracoeiro": {
      "title": "Gracoeiro",
      "desc": "J'ai conçu et développé le site web professionnel de Bárbara Graçoeiro, experte en recouvrement de créances, mettant en avant son parcours professionnel impressionnant et ses certifications professionnelles. Son design épuré et moderne, associé à une navigation intuitive, renforce sa crédibilité tout en présentant clairement ses services spécialisés. Optimisé pour le référencement et entièrement adapté aux mobiles, le site web est désormais une plateforme incontournable pour convertir les visiteurs en clients."
    },
    "joaocerqueirapereira": {
      "title": "João Cerqueira Pereira",
      "desc": "J'ai repensé et développé le site web de João Cerqueira Pereira LDA, une entreprise portugaise spécialisée dans les installations électriques depuis 1977. Le nouveau design met en valeur leur expertise technique à travers une esthétique épurée et corporative qui reflète la rigueur de leur domaine, avec une navigation intuitive adaptée aux particuliers comme aux professionnels. Optimisé pour le SEO et entièrement adapté aux mobiles."
    },
    "artseecounsel": {
      "title": "Artseecounsel",
      "desc": "(en cours) Développement sur mesure d'un site web vitrine élégant et performant pour ArtseeCounsel, consultant financier indépendant. L'objectif était de créer une présence en ligne professionnelle qui inspire confiance et mette en avant l'expertise et les services sur mesure du consultant. J'ai réalisé ce site afin d'offrir une expérience utilisateur fluide et une présentation de contenu stratégique pour convertir les visiteurs en prospects qualifiés."
    }
  },

  "LegalNotices": {
    "title": "Mentions légales",
    "websitePublisher": "Éditeur du site Web",
    "myName": "Fernandes Nuno",
    "myAdress": "Rue Pierre Curie, 78370 Plaisir",
    "myPhone": "+33 7 71 80 29 21",
    "myEmail": "n.fernandes.contact@gmail.com",

    "hostingProvider": "Fournisseur d'hébergement",
    "hostingProviderName": "Vercel Inc",
    "hostingProviderWebSite": "www.vercel.com",

    "intellectualProperty": "Propriété intellectuelle",
    "intellectualPropertyDesc": "L'ensemble du contenu de ce site (textes, images, logos, code, etc.) est la propriété exclusive de Nuno Fernandes, sauf mention contraire. Toute reproduction, modification ou utilisation commerciale non autorisée est strictement interdite.",

    "personalData": "Données personnelles",
    "personalDataDesc": "Ce site ne collecte aucune donnée personnelle sans consentement explicite. Les informations fournies via les formulaires de contact (nom, adresse e-mail, message) sont utilisées uniquement pour répondre aux demandes de renseignements. Elles ne sont jamais partagées avec des tiers et ne sont pas stockées dans des bases de données.",

    "cookies": "Cookies",
    "cookiesDesc": "Ce site n'utilise aucun cookie de suivi ni de publicité. Les cookies techniques (essentiels au fonctionnement) ne stockent aucune information identifiable.",

    "liability": "Responsabilité",
    "liabilityDesc": "Bien que je m'efforce d'assurer l'exactitude du contenu, je ne peux garantir son exhaustivité. Pour signaler une erreur, veuillez me contacter à l'adresse e-mail ci-dessus.",

    "externalLinks": "Liens externes",
    "externalLinksDesc": "Les liens vers des sites tiers n'impliquent aucune approbation. Je ne suis pas responsable de leur contenu ni de leurs pratiques en matière de confidentialité.",

    "governingLaw": "Loi applicable",
    "governingLawDesc": "Ce site est régi par le droit français. Tout litige sera de la compétence du tribunal de Versailles (Yvelines, France).",

    "closeBtnText": "Fermer"
  }
}
