{
  "HomePage": {
    "navbarHome": "Início",
    "navbarServices": "Serviços",
    "navbarTechnologies": "Tecnologias",
    "navbarPortfolio": "Portfolio",
    "navbarContact": "Contacto",

    "title": "Desenvolvedor Full Stack",
    "subtitle": "Como desenvolvedor freelancer, desenho e desenvolvo aplicações web e mobile personalizadas. Seja a trabalhar diretamente com clientes ou a colaborar com profissionais de tecnologia e design, entrego soluções personalizadas e de alta qualidade para ir ao encontro das suas necessidades.",

    "ctlText": "Tem uma ideia ?",
    "ctlText2": "Posso transformá-la num produto.",

    "ctlBtnText": "Entre em contacto comigo",
    "linkedinBtnTitleText": "Visite o meu perfil LinkedIn",
    "maltBtnTitleText": "Visite o meu perfil Malt",

    "servicesTitle": "O que eu faço ?",
    "servicesSubtitle": "Crio e mantenho sites e aplicações móveis de alto desempenho seguros, escaláveis e adaptados aos seus objetivos. Do conceito ao suporte a longo prazo, vamos transformar a sua visão digital em realidade.",

    "techsTitle": "Tecnologias que utilizo",
    "techsSubtitle": "Utilizo tecnologias de ponta para construir soluções de alto desempenho em todo o ciclo de vida do desenvolvimento. Adotando continuamente as mais recentes inovações do setor, crio sistemas escaláveis, prontos para desafios futuros.",

    "projectsTitle": "Alguns Projetos",
    "projectsSubtitle": "Explore o meu trabalho recente. Transformar ideias em soluções técnicas poderosas.",

    "getIntouch": "Entre em contacto !",
    "getIntouchSubtitle": "Tem alguma dúvida ou projeto em mente? Vamos conversar !",

    "dontLikeFormsText": "Não gosta de formulários ?",
    "dontLikeFormsTextForSendMail": "Envie-me um e-mail.",

    "formTitle": "Envie-me uma mensagem",
    "formName": "Nome",
    "formNamePlaceholder": "O seu nome completo",

    "formEmail": "Email",
    "formEmailPlaceholder": "meu.email@examplo.com",

    "formMessage": "Mensagem",
    "formMessagePlaceholder": "Diga-nos como podemos ajudá-lo...",

    "formBtnSendMessageText": "Enviar mensagem",
    "formBtnSendingMessageText": "Enviando...",

    "successMessageToast": "Mensagem enviada com sucesso !",
    "errorMessageToast": "Ocorreu um erro. Tente novamente mais tarde !",

    "rgpd": "Avisos legais",

    "closeBtn": "Fechar",
    "seeProjectBtn": "Ver projeto"
  },

  "Services": {
    "service1": {
      "title": "Desenvolvimento Web",
      "description": "Crio soluções personalizadas para sites de demonstração e aplicações web complexas, combinando design intuitivo, estética e arquitetura robusta. Construo sites de alto desempenho otimizados para SEO utilizando as mais recentes tecnologias e frameworks para oferecer resultados modernos e eficientes."
    },
    "service2": {
      "title": "Desenvolvimento Móvel",
      "description": "Desenvolvo aplicações móveis híbridas para smartphones e tablets, utilizando frameworks como o Flutter ou o React Native para oferecer soluções personalizadas. O meu trabalho destaca-se pelo forte foco na ergonomia e no design, garantindo usabilidade e apelo visual. Mantenho-me à frente integrando as mais recentes tecnologias e frameworks para um desempenho de vanguarda."
    },
    "service3": {
      "title": "Manutenção e Suporte",
      "description": "Ofereço serviços de manutenção fiáveis e proativos para garantir que o seu website ou aplicação funcione perfeitamente o tempo todo. Mantenho os seus ativos digitais seguros, atualizados e alinhados com as tecnologias em evolução. O meu objetivo é minimizar o tempo de inatividade e, ao mesmo tempo, maximizar a eficiência, para que se possa concentrar no crescimento do seu negócio."
    }
  },

  "Projects": {
    "gracoeiro": {
      "title": "Gracoeiro",
      "desc": "Criei e desenvolvi o website profissional da especialista em cobranças Bárbara Graçoeiro, apresentando o seu impressionante percurso profissional e certificações profissionais. O design clean e moderno, aliado à navegação intuitiva, reforça a sua credibilidade e apresenta de forma clara os seus serviços especializados. Otimizado para SEO e totalmente compatível com dispositivos móveis, o site tornou-se uma plataforma de referência para converter visitantes em clientes."
    },
    "joaocerqueirapereira": {
      "title": "João Cerqueira Pereira",
      "desc": "Redesenhei e desenvolvi o website da João Cerqueira Pereira LDA, empresa portuguesa especializada em instalações elétricas desde 1977. O novo design destaca a sua competência técnica através de uma estética corporativa e limpa que reflete o rigor da sua área, com navegação intuitiva adequada tanto para particulares como para profissionais. Otimizado para SEO e totalmente otimizado para dispositivos móveis."
    },
    "artseecounsel": {
      "title": "Artseecounsel",
      "desc": "(em curso) Desenvolvimento personalizado de um website de demonstração elegante e de alto desempenho para a ArtseeCounsel, uma consultora financeira independente. O objetivo foi criar uma presença online profissional que inspirasse confiança e que destacasse a expertise e os serviços personalizados da consultora. Criei este website para proporcionar uma experiência de utilizador fluida e uma apresentação de conteúdo estratégica para converter visitantes em leads qualificados."
    },
    "Par Le Monde": {
      "title": "Par Le Monde",
      "desc": "Responsável pelo redesign do novo website, supervisionei todo o seu desenvolvimento em WordPress. Estruturei a nova arquitetura implementando o tema e as páginas principais e, em seguida, assegurei e otimizei o desempenho através da instalação e configuração de plugins dedicados (SEO, segurança, formulários). A minha função estendeu-se também à proposta de melhorias criativas na usabilidade e no design, garantindo uma experiência ideal para o utilizador."
    }
  },

  "LegalNotices": {
    "title": "Menções legais",
    "websitePublisher": "Editor du site",
    "myName": "Fernandes Nuno",
    "myAdress": "Rue Pierre Curie, 78370 Plaisir",
    "myPhone": "+33 7 71 80 29 21",
    "myEmail": "n.fernandes.contact@gmail.com",

    "hostingProvider": "Provedor de alojamento web",
    "hostingProviderName": "Vercel Inc",
    "hostingProviderWebSite": "www.vercel.com",

    "intellectualProperty": "Propriedade intelectual",
    "intellectualPropertyDesc": "Todo o conteúdo deste site (texto, imagens, logótipos, código, etc.) é propriedade exclusiva de Nuno Fernandes, salvo indicação em contrário. Qualquer reprodução, modificação ou utilização comercial não autorizada são estritamente proibidas.",

    "personalData": "Dados pessoais",
    "personalDataDesc": "Este site não recolhe dados pessoais sem consentimento explícito. As informações fornecidas através de formulários de contacto (nome, endereço de e-mail, mensagem) são utilizadas apenas para responder a consultas. Nunca são partilhadas com terceiros e não são armazenadas em bases de dados.",

    "cookies": "Cookies",
    "cookiesDesc": "Este site não utiliza cookies de rastreio nem publicidade. Os cookies técnicos (essenciais ao funcionamento) não armazenam qualquer informação identificável.",

    "liability": "Responsabilidade",
    "liabilityDesc": "Embora me esforce por garantir a exatidão do conteúdo, não posso garantir a sua integralidade. Para comunicar um erro, contacte-me pelo endereço de e-mail acima.",

    "externalLinks": "Links externos",
    "externalLinksDesc": "Links para sites de terceiros não implicam qualquer aprovação. Não sou responsável pelo seu conteúdo ou práticas de privacidade.",

    "governingLaw": "Lei aplicável",
    "governingLawDesc": "Este site é regido pela lei francesa. Qualquer litígio estará sujeito à jurisdição do tribunal de Versalhes (Yvelines, França).",

    "closeBtnText": "Fechar"
  },

  "ValidationForm": {
    "nameError": "O nome deve ter pelo menos 2 caracteres.",
    "emailError": "Endereço de e-mail inválido",
    "messageError": "A mensagem deve ter pelo menos 20 caracteres."
  }
}
